Revit 2027 API
OverrideGraphicSettings.SetHalftone Method
 Sets the halftone value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetHalftone(
	bool halftone
)
Public Function SetHalftone (
	halftone As Boolean
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetHalftone(
	bool halftone
)
member SetHalftone :
        halftone : bool -> OverrideGraphicSettings
Parameters
halftone Boolean
 True if the override displays in halftone, false otherwise.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace